[
  {
    "image": "https://i.ibb.co.com/vxBWhVVw/joshborup-facebook-2429746-1280.png",
    "title": "Facebook",
    "companyName": "Meta",
    "id": 1,
       "description": "Facebook is one of the largest social media platforms in the world, designed to help people connect and communicate globally. Users can create personal profiles, add friends, follow pages, and join groups based on shared interests. The platform allows sharing text posts, photos, videos, live streams, and temporary stories. Facebook Groups create communities for discussion, collaboration, and event planning, while Pages help businesses and creators promote their brands. Marketplace enables buying and selling products locally. Users can react, comment, and share posts to engage with content. Integrated Messenger allows instant messaging and video calls. Facebook also provides advanced privacy controls, security settings, and targeted advertising tools for businesses. With billions of active users, Facebook combines communication, entertainment, marketing, and community building into one powerful digital ecosystem."
,
    "size": 125,
    "reviews": 120,
    "ratingAvg": 4.3,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 7200000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/cMvVsfN/sllmnht-yt-6273367-1280.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 2,
    "description": "YouTube is a global video-sharing and streaming platform where users can watch, upload, and share videos across many categories including music, education, gaming, tutorials, entertainment, and live events. Users can subscribe to channels, like and comment on videos, create playlists, and receive personalized recommendations based on viewing history. Creators can monetize content through advertisements, memberships, and partnerships. YouTube Studio provides analytics tools to track performance and audience engagement. Features like YouTube Shorts support short-form vertical videos, while live streaming allows real-time interaction. Offline viewing, subtitles, and parental controls improve accessibility. Businesses and educators use YouTube for marketing and knowledge sharing. With billions of daily views, YouTube has transformed digital entertainment and global learning.",
    "size": 200,
    "reviews": 150,
    "ratingAvg": 4.5,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 9400000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qY5Zznm5/danneiva-whatsapp-873316-1280.png",
    "title": "WhatsApp",
    "companyName": "Meta",
    "id": 3,
       "description": "WhatsApp is a secure messaging application that enables users to send instant text messages, voice notes, images, videos, documents, and contacts. It supports high-quality voice and video calls, including group calls, all protected with end-to-end encryption for privacy. Users can create group chats, broadcast lists, and communities for better organization. The Status feature allows sharing updates that disappear after 24 hours. WhatsApp Web and desktop versions allow cross-device synchronization. Features like live location sharing, disappearing messages, and chat backups improve functionality. WhatsApp Business helps companies connect with customers through automated replies and catalogs. With strong privacy protections and simple design, WhatsApp remains one of the most trusted communication apps worldwide."
,
    "size": 220,
    "reviews": 180,
    "ratingAvg": 4.4,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 700000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 11600000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/HT4TjZ0N/raphaelsilva-instagram-3814080-1280.jpg",
    "title": "Instagram",
    "companyName": "Meta",
    "id": 4,
        "description": "Instagram is a visual-focused social networking platform where users share photos, reels, and stories. It offers creative tools such as filters, effects, music integration, and editing options to enhance content. Users can follow friends, celebrities, and brands, engage through likes and comments, and communicate using direct messages. The Explore page suggests trending and personalized content. Instagram Live enables real-time streaming, while shopping features allow businesses to sell directly through the app. Influencers use Instagram to build personal brands and collaborate with companies. Privacy settings and account controls provide user safety. Instagram plays a major role in digital culture and online marketing."
,
    "size": 280,
    "reviews": 130,
    "ratingAvg": 4.4,
    "downloads": 200,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 450000 },
      { "name": "3 star", "count": 950000 },
      { "name": "4 star", "count": 3200000 },
      { "name": "5 star", "count": 7800000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/mrKhh65b/coy-muse-tiktok-7411567-1280.png",
    "title": "TikTok",
    "companyName": "ByteDance",
    "id": 5,
        "description": "TikTok is a short-form video platform that allows users to create and watch engaging videos with music, filters, and special effects. The app’s For You page uses advanced algorithms to personalize content based on user interests. People participate in viral challenges, trends, and creative storytelling. TikTok supports live streaming and creator monetization through gifts and partnerships. Businesses use TikTok for brand promotion and influencer marketing. Its simple editing tools and wide reach make it one of the fastest-growing entertainment platforms globally."
,
    "size": 295,
    "reviews": 100,
    "ratingAvg": 4.2,
    "downloads": 300,
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 5100000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/6RNF21jd/memed-nurrohmad-tag-1873545-1280.png",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 6,
        "description": "Google Maps is a powerful navigation service that provides real-time GPS directions, traffic updates, and route optimization. Users can explore nearby restaurants, hotels, and attractions with ratings and reviews. Street View offers immersive visual navigation. Offline maps allow usage without internet. Businesses can manage listings and respond to reviews. Google Maps is widely used for travel planning, commuting, and discovering new places."
,
    "size": 270,
    "reviews": 900,
    "ratingAvg": 4.6,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 5850000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/gZM9cmSX/sayyid96-technology-7002906-1280.png",
    "title": "Spotify",
    "companyName": "Spotify Ltd",
    "id": 7,
        "description": "Spotify is a leading music streaming platform offering millions of songs and podcasts. Users can create playlists, follow artists, and receive personalized recommendations like Discover Weekly. Offline downloads allow listening without internet. Spotify supports podcasts, audiobooks, and exclusive shows. Artists can distribute music globally and analyze performance data. High-quality streaming and cross-device syncing create a seamless audio experience."
,
    "size": 285,
    "reviews": 700,
    "ratingAvg": 4.5,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 4150000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/F4PRtmST/sllmnht-telegram-6896827-1280.png",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 8,
        "description": "Telegram is a cloud-based messaging app focused on speed and security. It supports large groups, broadcast channels, bots, and large file sharing. Secret chats offer end-to-end encryption. Users can customize themes and stickers. Telegram syncs messages across devices instantly. Channels allow creators to broadcast to unlimited subscribers."
,
    "size": 160,
    "reviews": 60,
    "ratingAvg": 4.3,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 450000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 3550000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/FkrvKKqz/shadefx-messenger-6022337-1280.png",
    "title": "Messenger",
    "companyName": "Meta",
    "id": 9,
       "description": "Messenger is an instant messaging app connected to Facebook. It allows text chats, voice messages, video calls, and group conversations. Users can send photos, videos, stickers, and reactions. Messenger Rooms enable large group video meetings. Businesses use Messenger for customer communication and automation."
,
    "size": 270,
    "reviews": 800,
    "ratingAvg": 4.3,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 4600000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Wp6Dq581/download.png",
    "title": "Netflix",
    "companyName": "Netflix Inc.",
    "id": 10,
       "description": "Netflix is a subscription-based streaming service offering movies, TV shows, and original series. It provides personalized recommendations based on viewing habits. Users can download content for offline viewing and create multiple profiles. Parental controls ensure family-friendly usage."
,
    "size": 110,
    "reviews": 900,
    "ratingAvg": 4.4,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 5350000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Z1mshnyZ/download-1.png",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 11,
        "description": "Gmail is a free email service with advanced spam filtering and security. Users can organize emails using labels, filters, and categories. It integrates with Google Workspace apps like Drive and Calendar. Gmail provides large storage and strong account protection."
,
    "size": 155,
    "reviews": 1000,
    "ratingAvg": 4.5,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 180000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 6620000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/VcPVXMS1/wikimediaimages-google-chrome-1326908-640.png",
    "title": "Google Chrome",
    "companyName": "Google LLC",
    "id": 12,
        "description": "Google Chrome is a fast and secure web browser known for speed and simplicity. It syncs bookmarks, passwords, and history across devices. Chrome supports extensions and developer tools. Incognito mode enhances privacy while browsing."
,
    "size": 175,
    "reviews": 950,
    "ratingAvg": 4.4,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 5250000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zz3zr0cG/meesgroothuis-video-call-phone-5914058-640.png",
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "id": 13,
        "description": "Zoom is a video conferencing platform used for meetings, classes, and webinars. It offers screen sharing, breakout rooms, chat, and recording features. Zoom became essential for remote work and online education."
,
    "size": 85,
    "reviews": 600,
    "ratingAvg": 4.2,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 2900000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/yF8HFcWr/kirstyfields-amazon-2183855-640.png",
    "title": "Amazon",
    "companyName": "Amazon Inc.",
    "id": 14,
        "description": "Amazon is a leading e-commerce platform where users can purchase millions of products. Features include customer reviews, order tracking, secure payments, and fast delivery options. Amazon also offers digital services like Prime Video."
,
    "size": 95,
    "reviews": 850,
    "ratingAvg": 4.4,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 350000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 650000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 4700000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Rpcb1DB8/terilynn-google-1632434-640.png",
    "title": "Google Play Store",
    "companyName": "Google LLC",
    "id": 15,
      "description": "Google Play Store is the official marketplace for Android apps, games, movies, and books. It provides ratings, reviews, and personalized recommendations. Developers distribute applications globally through the platform."
,
    "size": 130,
    "reviews": 110,
    "ratingAvg": 4.3,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 6300000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/YBymbvMN/janjf93-camera-1933338-640.png",
    "title": "Google Photos",
    "companyName": "Google LLC",
    "id": 16,
        "description": "Google Photos is a cloud-based storage service that automatically backs up photos and videos. It uses smart organization, facial recognition, and search tools to find memories easily. Sharing albums and editing tools enhance user experience."
,
    "size": 165,
    "reviews": 700,
    "ratingAvg": 4.5,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 180000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 4220000 }
    ]
  }
]
 